system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/systemParameters"
// convertToMeters 1;

vertices
(
    (  0   0    0)   // 0
    ($Lx   0    0)   // 1
    ($Lx $Ly    0)   // 2
    (  0 $Ly    0)   // 3

    (  0   0  $Lz)   // 4
    ($Lx   0  $Lz)   // 5
    ($Lx $Ly  $Lz)   // 6
    (  0 $Ly  $Lz)   // 7
);

blocks
(hex ( 0 1 2 3 4 5 6 7) ($Nx $Ny $Nz) simpleGrading (1 1 1));

edges
(
);

boundary
(

    x0
    {
        type cyclic;
        neighbourPatch xL;
        faces ((0 4 7 3));
    }

    xL
    {
        type cyclic;
        neighbourPatch x0;
        faces ((1 2 6 5));
    }

    y0
    {
	    type cyclic;
        neighbourPatch yL;
        faces ((0 1 5 4));
    }

    yL
    {
	    type cyclic;
        neighbourPatch y0;
        faces ((3 7 6 2));
    }

    z0
    {
	    type cyclic;
        neighbourPatch zL;
	    faces    ((0 3 2 1));
    }

    zL
    {
	    type cyclic;
        neighbourPatch z0;
        faces     ((4 5 6 7));
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
