system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version       2.0;  
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoamMod;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         150000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      2;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

functions
{
  volumeIntegrals
  {
     type            volFieldValue;
     libs            ("libfieldFunctionObjects.so");
     log             true;
     writeControl    writeTime;
     enabled         true;
     writeFields     true;
     regionType      cellZone;
     name 	         water;
     operation       volIntegrate;
     fields
     (
         U
         p
         gp
     );
  }

  surfaceIntegrals
  {
     type            surfaceFieldValue;
     libs            ("libfieldFunctionObjects.so");
     log             true;
     writeControl    writeTime;
     writeFields     false;
     regionType      patch;
     name 	         spheres;
     operation       areaIntegrate;
     fields
     (
      gradUn
      pn
      n
      gpn
     );
  }
}

// ************************************************************************* //
