system/snappyHexMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object snappyHexMeshDict;
}

#include        "include/systemParameters"
baseLvl 0;
surfLvl #calc "$baseLvl + 1";

castellatedMesh yes;
snap yes;
addLayers no;
geometry
{
  spheres.stl
  {
    type triSurfaceMesh;
    name spheres;
  }

  refinementBox
    {
            type    searchableBox;
            min             (0   0   0. );
            max             ($Lx $Ly $Lz);
    }
} 	// controls for castellated mesh

// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    maxLocalCells 1000000000;
    maxGlobalCells 2000000000;

    minRefinementCells 10;
    maxLoadUnbalance 0.50;
    nCellsBetweenLevels 3;

    // minRefinementCells 0;
    // nCellsBetweenLevels 1;

    features
    (
    );

    refinementSurfaces
    {
	 spheres { level ( $surfLvl $surfLvl );  }
    }

    resolveFeatureAngle 20;

    refinementRegions
    {
        refinementBox
        {
            mode inside;
                levels (($baseLvl $baseLvl));
        }

    }

	locationInMesh ( .7 11.75 0.001 );
    allowFreeStandingZoneFaces false;
}



// Settings for the snapping.
snapControls
{
    nSmoothPatch    3;
    tolerance       1.0;
    nSolveIter      30;
    nRelaxIter      5;
}



// Settings for the layer addition.
addLayersControls
{
  relativeSizes false;
  layers
  {
      "spheres.*"
      {
          nSurfaceLayers 3;
      }
  }
  
    expansionRatio          1.2;
    finalLayerThickness     0.5;
    minThickness            1;

    nGrow 0;
    featureAngle 30;
    nRelaxIter 10;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.8;
    maxThicknessToMedialRatio 0.8;
    minMedianAxisAngle 40;
    nBufferCellsNoExtrude 0;
    nLayerIter 100;
    nRelaxedIter 20;
    minMedialAxisAngle 90; 
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-250;
    minTetQuality 1e-25;
    minArea -1;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 1e-1;
    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}
    // Advanced

    //- Number of error distribution iterations
    // nSmoothScale 4;
    //- Amount to scale back displacement at error points
    // errorReduction 0.75;



// Advanced

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-8;
