system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/systemParameters"

actions
(
    // water
    {
        name    waterCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo{box     (0 0 0) ($Lx $Ly $Lz);}
    }
    {
        name    water;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo{set     waterCellSet;}
    }
);


// ************************************************************************* //
